bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/sys_ahbp_struct.h
typedef volatile union {
	struct {
		uint32_t h26d_buffb_enable                :  1; /**<bit[0 : 0] */
		uint32_t reserved_bit_1_31                : 31; /**<bit[1 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg40_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffb_begin                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg41_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffb_size                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg42_t;


typedef volatile union {
	struct {
		uint32_t h26d_picb_begin                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg43_t;


typedef volatile union {
	struct {
		uint32_t h26d_picb_halfbuff_end           : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg44_t;


typedef volatile union {
	struct {
		uint32_t h26d_picb_end                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg45_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_31                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg46_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffb_remap_addr            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg47_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffc_enable                :  1; /**<bit[0 : 0] */
		uint32_t reserved_bit_1_31                : 31; /**<bit[1 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg48_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffc_begin                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg49_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffc_size                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg4a_t;


typedef volatile union {
	struct {
		uint32_t h26d_picc_begin                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg4b_t;


typedef volatile union {
	struct {
		uint32_t h26d_picc_halfbuff_end           : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg4c_t;


typedef volatile union {
	struct {
		uint32_t h26d_picc_end                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg4d_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_31                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg4e_t;


typedef volatile union {
	struct {
		uint32_t h26d_buffc_remap_addr            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg4f_t;


typedef volatile union {
	struct {
		uint32_t ram_spsh_cfg                     : 10; /**<bit[0 : 9] */
		uint32_t ram_spbh_cfg                     : 11; /**<bit[10 : 20] */
		uint32_t reserved_bit_21_23               :  3; /**<bit[21 : 23] */
		uint32_t ram_spsh_set_key                 :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg50_t;


typedef volatile union {
	struct {
		uint32_t ram_stph_cfg                     : 12; /**<bit[0 : 11] */
		uint32_t reserved_bit_12_23               : 12; /**<bit[12 : 23] */
		uint32_t ram_stph_set_key                 :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg51_t;


typedef volatile union {
	struct {
		uint32_t ram_spsl_cfg                     : 10; /**<bit[0 : 9] */
		uint32_t ram_spbl_cfg                     : 11; /**<bit[10 : 20] */
		uint32_t reserved_bit_21_23               :  3; /**<bit[21 : 23] */
		uint32_t ram_spsl_set_key                 :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg52_t;


typedef volatile union {
	struct {
		uint32_t ram_stpl_cfg                     : 12; /**<bit[0 : 11] */
		uint32_t reserved_bit_12_23               : 12; /**<bit[12 : 23] */
		uint32_t ram_stpl_set_key                 :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_ahbp_reg53_t;

typedef volatile struct {
	volatile sys_ahbp_reg0_t reg0;
	volatile sys_ahbp_reg1_t reg1;
	volatile sys_ahbp_reg2_t reg2;
	volatile sys_ahbp_reg3_t reg3;
	volatile sys_ahbp_reg4_t reg4;
	volatile sys_ahbp_reg5_t reg5;
	volatile sys_ahbp_reg6_t reg6;
	volatile sys_ahbp_reg7_t reg7;
	volatile sys_ahbp_reg8_t reg8;
	volatile sys_ahbp_reg9_t reg9;
	volatile sys_ahbp_rega_t rega;
	volatile sys_ahbp_regb_t regb;
	volatile sys_ahbp_regc_t regc;
	volatile sys_ahbp_regd_t regd;
	volatile sys_ahbp_rege_t rege;
	volatile sys_ahbp_regf_t regf;
	volatile sys_ahbp_reg10_t reg10;
	volatile sys_ahbp_reg11_t reg11;
	volatile sys_ahbp_reg12_t reg12;
	volatile sys_ahbp_reg13_t reg13;
	volatile sys_ahbp_reg14_t reg14;
	volatile sys_ahbp_reg15_t reg15;
	volatile sys_ahbp_reg16_t reg16;
	volatile sys_ahbp_reg17_t reg17;
	volatile sys_ahbp_reg18_t reg18;
	volatile sys_ahbp_reg19_t reg19;
	volatile sys_ahbp_reg1a_t reg1a;
	volatile sys_ahbp_reg1b_t reg1b;
	volatile sys_ahbp_reg1c_t reg1c;
	volatile sys_ahbp_reg1d_t reg1d;
	volatile sys_ahbp_reg1e_t reg1e;
	volatile sys_ahbp_reg1f_t reg1f;
	volatile sys_ahbp_reg20_t reg20;
	volatile sys_ahbp_reg21_t reg21;
	volatile sys_ahbp_reg22_t reg22;
	volatile sys_ahbp_reg23_t reg23;
	volatile sys_ahbp_reg24_t reg24;
	volatile sys_ahbp_reg25_t reg25;
	volatile sys_ahbp_reg26_t reg26;
	volatile sys_ahbp_reg27_t reg27;
	volatile sys_ahbp_reg28_t reg28;
	volatile sys_ahbp_reg29_t reg29;
	volatile sys_ahbp_reg2a_t reg2a;
	volatile sys_ahbp_reg2b_t reg2b;
	volatile sys_ahbp_reg2c_t reg2c;
	volatile sys_ahbp_reg2d_t reg2d;
	volatile sys_ahbp_reg2e_t reg2e;
	volatile sys_ahbp_reg2f_t reg2f;
	volatile sys_ahbp_reg30_t reg30;
	volatile sys_ahbp_reg31_t reg31;
	volatile sys_ahbp_reg32_t reg32;
	volatile sys_ahbp_reg33_t reg33;
	volatile sys_ahbp_reg34_t reg34;
	volatile sys_ahbp_reg35_t reg35;
	volatile sys_ahbp_reg36_t reg36;
	volatile sys_ahbp_reg37_t reg37;
	volatile sys_ahbp_reg38_t reg38;
	volatile sys_ahbp_reg39_t reg39;
	volatile sys_ahbp_reg3a_t reg3a;
	volatile sys_ahbp_reg3b_t reg3b;
	volatile sys_ahbp_reg3c_t reg3c;
	volatile sys_ahbp_reg3d_t reg3d;
	volatile sys_ahbp_reg3e_t reg3e;
	volatile sys_ahbp_reg3f_t reg3f;
	volatile sys_ahbp_reg40_t reg40;
	volatile sys_ahbp_reg41_t reg41;
	volatile sys_ahbp_reg42_t reg42;
	volatile sys_ahbp_reg43_t reg43;
	volatile sys_ahbp_reg44_t reg44;
	volatile sys_ahbp_reg45_t reg45;
	volatile sys_ahbp_reg46_t reg46;
	volatile sys_ahbp_reg47_t reg47;
	volatile sys_ahbp_reg48_t reg48;
	volatile sys_ahbp_reg49_t reg49;
	volatile sys_ahbp_reg4a_t reg4a;
	volatile sys_ahbp_reg4b_t reg4b;
	volatile sys_ahbp_reg4c_t reg4c;
	volatile sys_ahbp_reg4d_t reg4d;
	volatile sys_ahbp_reg4e_t reg4e;
	volatile sys_ahbp_reg4f_t reg4f;
	volatile sys_ahbp_reg50_t reg50;
	volatile sys_ahbp_reg51_t reg51;
	volatile sys_ahbp_reg52_t reg52;
	volatile sys_ahbp_reg53_t reg53;
} sys_ahbp_hw_t;

#ifdef __cplusplus
}
#endif
